package user

type DepartmentWithDistrict struct {
	Department   Department
	DistrictCode string
}

type Department struct {
	Code  string
	Title string
}

func (d Department) String() string { return d.Title }

// ·        Отдел организации надзора

// ·        Отдел социально-гигиенического мониторинга

// ·        Отдел надзора по коммунальной гигиене

// ·        Отдел надзора по гигиене труда, радиационной гигиене и на транспорте

// ·        Отдел надзора по гигиене питания

// ·        Отдел надзора по гигиене детей и подростков

// ·        Отдел государственной регистрации и лицензирования

// ·        Отдел эпидемиологического надзора

// ·        Отдел санитарной охраны территории и контроля за медицинскими организациями

// ·        Отдел защиты прав потребителей

// ·        Отдел юридического обеспечения

// ·        Отдел документационного обеспечения деятельности

// ·        Отдел государственной службы и кадров

// ·        Отдел финансово-экономический

// ·        Отдел имущественного комплекса, государственных закупок и хозяйственного обеспечения

// ·        Отдел информационных технологий

// ·        Отдел по информированию и работе со средствами массовой информации

// ·        Руководство
